In [3]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('./mod06/movies.dat', sep='::',
                       header=None, names=mnames, encoding = "ISO-8859-1", engine = 'python') # 注意編碼跟引擎
movies

,movie_id,title,genres
0,1,Toy Story (1995),Animation|Children's|Comedy
1,2,Jumanji (1995),Adventure|Children's|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
3878,3948,Meet the Parents (2000),Comedy
3879,3949,Requiem for a Dream (2000),Drama
3880,3950,Tigerland (2000),Drama
3881,3951,Two Family House (2000),Drama
3882,3952,"Contender, The (2000)",Drama|Thriller

In [4]:
#取出genres  並拆開 |

all_genres=[]
for i in movies.genres:
    all_genres.extend(i.split('|'))
all_genres

['Animation',
 "Children's",
 'Comedy',
 'Adventure',
 "Children's",
 'Fantasy',
 'Comedy',
 'Romance',
 'Comedy',
 'Drama',
 'Comedy',
 'Action',
 'Crime',
 'Thriller',
 'Comedy',
 'Romance',
 'Adventure',
 "Children's",
 'Action',
 'Action',
 'Adventure',
 'Thriller',
 'Comedy',
 'Drama',
 'Romance',
 'Comedy',
 'Horror',
 'Animation',
 "Children's",
 'Drama',
 'Action',
 'Adventure',
 'Romance',
 'Drama',
 'Thriller',
 'Drama',
 'Romance',
 'Thriller',
 'Comedy',
 'Action',
 'Action',
 'Comedy',
 'Drama',
 'Crime',
 'Drama',
 'Thriller',
 'Thriller',
 'Drama',
 'Sci-Fi',
 'Drama',
 'Romance',
 'Drama',
 'Drama',
 'Romance',
 'Adventure',
 'Sci-Fi',
 'Drama',
 'Drama',
 'Drama',
 'Sci-Fi',
 'Adventure',
 'Romance',
 "Children's",
 'Comedy',
 'Drama',
 'Drama',
 'Romance',
 'Drama',
 'Documentary',
 'Comedy',
 'Comedy',
 'Romance',
 'Drama',
 'Drama',
 'War',
 'Action',
 'Crime',
 'Drama',
 'Drama',
 'Action',
 'Adventure',
 'Comedy',
 'Drama',
 'Drama',
 'Romance',
 'Crime',
 'Thriller',
 'Animation',
 "Children's",
 'Musical',
 'Romance',
 'Drama',
 'Romance',
 'Crime',
 'Thriller',
 'Action',
 'Drama',
 'Thriller',
 'Comedy',
 'Drama',
 "Children's",
 'Comedy',
 'Drama',
 'Adventure',
 "Children's",
 'Fantasy',
 'Drama',
 'Drama',
 'Romance',
 'Drama',
 'Mystery',
 'Adventure',
 "Children's",
 'Fantasy',
 'Drama',
 'Thriller',
 'Drama',
 'Comedy',
 'Comedy',
 'Romance',
 'Comedy',
 'Sci-Fi',
 'Thriller',
 'Drama',
 'Comedy',
 'Romance',
 'Comedy',
 'Action',
 'Comedy',
 'Crime',
 'Horror',
 'Thriller',
 'Action',
 'Comedy',
 'Drama',
 'Drama',
 'Musical',
 'Drama',
 'Romance',
 'Comedy',
 'Drama',
 'Sci-Fi',
 'Thriller',
 'Documentary',
 'Drama',
 'Drama',
 'Thriller',
 'Drama',
 'Crime',
 'Drama',
 'Romance',
 'Drama',
 'Drama',
 'Comedy',
 'Drama',
 'Drama',
 'Romance',
 'Adventure',
 'Drama',
 "Children's",
 'Comedy',
 'Comedy',
 'Action',
 'Thriller',
 'Drama',
 'Drama',
 'Thriller',
 'Comedy',
 'Romance',
 'Drama',
 'Action',
 'Thriller',
 'Comedy',
 'Drama',
 'Action',
 'Thriller',
 'Documentary',
 'Drama',
 'Thriller',
 'Comedy',
 'Comedy',
 'Thriller',
 'Comedy',
 'Drama',
 'Romance',
 'Comedy',
 'Drama',
 'Adventure',
 "Children's",
 'Comedy',
 'Musical',
 'Documentary',
 'Comedy',
 'Action',
 'Drama',
 'War',
 'Drama',
 'Thriller',
 'Action',
 'Adventure',
 'Crime',
 'Drama',
 'Mystery',
 'Drama',
 'Comedy',
 'Documentary',
 'Crime',
 'Comedy',
 'Romance',
 'Comedy',
 'Drama',
 'Drama',
 'Comedy',
 'Romance',
 'Drama',
 'Mystery',
 'Romance',
 'Drama',
 'Comedy',
 'Adventure',
 "Children's",
 'Fantasy',
 'Drama',
 'Documentary',
 'Comedy',
 'Romance',
 'Drama',
 'Drama',
 'Romance',
 'Thriller',
 'Comedy',
 'Drama',
 'Documentary',
 'Comedy',
 'Documentary',
 'Documentary',
 'Drama',
 'Action',
 'Drama',
 'Drama',
 'Romance',
 'Comedy',
 'Drama',
 'Drama',
 'Comedy',
 'Action',
 'Adventure',
 "Children's",
 'Drama',
 'Drama',
 'Crime',
 'Drama',
 'Thriller',
 'Drama',
 'Drama',
 'Romance',
 'War',
 'Horror',
 'Action',
 'Adventure',
 'Comedy',
 'Crime',
 'Drama',
 'Drama',
 'War',
 'Comedy',
 'Comedy',
 'War',
 'Adventure',
 "Children's",
 'Drama',
 'Action',
 'Adventure',
 'Mystery',
 'Sci-Fi',
 'Drama',
 'Thriller',
 'War',
 'Documentary',
 'Action',
 'Romance',
 'Thriller',
 'Crime',
 'Film-Noir',
 'Mystery',
 'Thriller',
 'Action',
 'Thriller',
 'Comedy',
 'Drama',
 'Drama',
 'Action',
 'Adventure',
 'Drama',
 'Romance',
 'Adventure',
 "Children's",
 'Drama',
 'Action',
 'Crime',
 'Thriller',
 'Comedy',
 'Action',
 'Sci-Fi',
 'Thriller',
 'Action',
 'Adventure',
 'Sci-Fi',
 'Comedy',
 'Drama',
 'Comedy',
 'Horror',
 'Comedy',
 'Drama',
 'Romance',
 'Comedy',
 'Action',
 "Children's",
 'Drama',
 'Romance',
 'Thriller',
 'Drama',
 'Sci-Fi',
 'Thriller',
 'Comedy',
 'Comedy',
 'Horror',
 'Comedy',
 'Thriller',
 'Drama',
 'Documentary',
 'Drama',
 'Drama',
 'Comedy',
 'Drama',
 'Romance',
 'Horror',
 'Sci-Fi',
 'Drama',
 'Action',
 'Crime',
 'Sci-Fi',
 'Drama',
 'Musical',
 'Thriller',
 'Drama',
 'Drama',
 'Romance',
 'Comedy',
 'Action',
 'Comedy',
 'Drama',
 'Documentary',
 'Drama',
 'Romance',
 'Action',
 'Adventure',
 'Drama',
 'Western',
 'Drama',
 'Comedy',
 'Drama',
 'Drama',
 'Drama',
 'Romance',
 'Comedy',
 'Drama',
 'Thriller',
 'Comedy',
 'Drama',
 'Drama',
 'Horror',
 'Drama',
 'Romance',
 'Comedy',
 'Comedy',
 'Drama',
 'Romance',
 'Drama',
 'Thriller',
 'Thriller',
 'Action',
 'Comedy',
 'Drama',
 'Thriller',
 'Drama',
 'Thriller',
 'Comedy',
 'Comedy',
 'Drama',
 'Drama',
 'Comedy',
 'Comedy',
 'Drama',
 'Comedy',
 'Romance',
 'Comedy',
 'Romance',
 'Adventure',
 "Children's",
 'Animation',
 "Children's",
 'Comedy',
 'Romance',
 'Thriller',
 "Children's",
 'Drama',
 'Drama',
 'Musical',
 'Comedy',
 'Animation',
 "Children's",
 'Crime',
 'Drama',
 'Documentary',
 'Drama',
 'Fantasy',
 'Romance',
 'Thriller',
 'Comedy',
 'Drama',
 'Romance',
 "Children's",
 'Comedy',
 'Action',
 'Comedy',
 'Romance',
 'Drama',
 'Horror',
 'Drama',
 'Comedy',
 'Comedy',
 'Sci-Fi',
 'Mystery',
 'Thriller',
 'Adventure',
 "Children's",
 'Comedy',
 'Fantasy',
 'Romance',
 'Crime',
 'Drama',
 'Thriller',
 'Action',
 'Adventure',
 'Fantasy',
 'Sci-Fi',
 'Drama',
 "Children's",
 'Drama',
 'Drama',
 'Drama',
 'Drama',
 'Romance',
 'Drama',
 'Romance',
 'War',
 'Western',
 'Comedy',
 'Drama',
 'Drama',
 'Drama',
 'Romance',
 'Drama',
 'Drama',
 'Drama',
 'Horror',
 'Comedy',
 'Comedy',
 'Comedy',
 'Romance',
 'Drama',
 'Comedy',
 'Drama',
 'Drama',
 'Thriller',
 'Drama',
 'Drama',
 'Crime',
 'Drama',
 'Action',
 'Crime',
 'Drama',
 'Horror',
 'Action',
 'Sci-Fi',
 'Thriller',
 'Comedy',
 'Romance',
 'Action',
 'Thriller',
 'Comedy',
 'Romance',
 'Crime',
 'Drama',
 'Thriller',
 'Action',
 'Drama',
 'Thriller',
 'Crime',
 'Drama',
 'Romance',
 'Thriller',
 'Comedy',
 'Romance',
 'Comedy',
 'Romance',
 'Crime',
 'Drama',
 'Drama',
 'Comedy',
 'Drama',
 'Drama',
 'Drama',
 'Romance',
 'Drama',
 'Romance',
 'Action',
 'Adventure',
 'Western',
 'Comedy',
 'Drama',
 'Comedy',
 'Drama',
 'Drama',
 'Drama',
 'Drama',
 'Comedy',
 'Horror',
 'Thriller',
 'Comedy',
 'Animation',
 "Children's",
 'Drama',
 'Action',
 'Action',
 'Adventure',
 'Sci-Fi',
 "Children's",
 'Comedy',
 'Fantasy',
 'Drama',
 'Thriller',
 'Film-Noir',
 'Thriller',
 'Drama',
 'Comedy',
 'Drama',
 'Comedy',
 'Comedy',
 'Drama',
 'Action',
 'Comedy',
 'Musical',
 'Sci-Fi',
 'Horror',
 'Action',
 'Adventure',
 'Sci-Fi',
 'Comedy',
 'Horror',
 'Drama',
 'Horror',
 'Sci-Fi',
 'Comedy',
 'Drama',
 'Mystery',
 'Thriller',
 'Drama',
 'War',
 'Drama',
 'Sci-Fi',
 'Thriller',
 'Comedy',
 'Romance',
 'Adventure',
 'Drama',
 'Drama',
 'Comedy',
 'Romance',
 "Children's",
 'Comedy',
 'Comedy',
 'Drama',
 'Drama',
 'Musical',
 'Drama',
 'Comedy',
 'Action',
 'Adventure',
 'Thriller',
 'Drama',
 'Mystery',
 'Thriller',
 'Comedy',
 'Drama',
 'Romance',
 'Comedy',
 'Action',
 'Romance',
 'Thriller',
 'Drama',
 "Children's",
 'Comedy',
 'Comedy',
 'Romance',
 'War',
 'Comedy',
 'Romance',
 'Drama',
 'Comedy',
 'Drama',
 'Romance',
 'Action',
 'Comedy',
 'Drama',
 'Romance',
 'Adventure',
 "Children's",
 'Romance',
 'Documentary',
 'Animation',
 "Children's",
 'Musical',
 'Drama',
 'Horror',
 'Comedy',
 'Crime',
 'Fantasy',
 'Action',
 'Comedy',
 'Western',
 'Drama',
 'Comedy',
 'Comedy',
 'Drama',
 'Comedy',
 'Drama',
 'Thriller',
 "Children's",
 'Comedy',
 'Drama',
 'Action',
 'Thriller',
 'Action',
 'Romance',
 'Thriller',
 'Comedy',
 'Romance',
 'Action',
 'Sci-Fi',
 'Action',
 'Adventure',
 'Comedy',
 'Romance',
 'Drama',
 'Drama',
 'Horror',
 'Western',
 'Action',
 'Drama',
 'Drama',
 'Action',
 'Comedy',
 'Drama',
 'Drama',
 'Romance',
 'War',
 'Action',
 'Comedy',
 'Drama',
 'Crime',
 'Drama',
 'Adventure',
 "Children's",
 'Action',
 'Action',
 'Drama',
 'Drama',
 'Horror',
 'Documentary',
 'Drama',
 'Drama',
 'Action',
 'Thriller',
 'Comedy',
 'Comedy',
 'Crime',
 'Drama',
 'Documentary',
 'Action',
 'Sci-Fi',
 'Drama',
 'Horror',
 'Thriller',
 'Drama',
 'Drama',
 'Comedy',
 'Comedy',
 'Drama',
 'Comedy',
 'Comedy',
 'Comedy',
 'Thriller',
 'Western',
 'Comedy',
 'Romance',
 'Drama',
 'Comedy',
 'Action',
 'Comedy',
 'Adventure',
 "Children's",
 'Thriller',
 'Action',
 'Thriller',
 'Drama',
 'Drama',
 'Romance',
 'Horror',
 'Sci-Fi',
 'Thriller',
 'Mystery',
 'Romance',
 'Thriller',
 'Drama',
 'Comedy',
 'Drama',
 'Crime',
 'Drama',
 'Comedy',
 'Western',
 'Comedy',
 'Action',
 'Adventure',
 'Crime',
 'Comedy',
 'Sci-Fi',
 'Drama',
 'Thriller',
 'Comedy',
 'Action',
 'Comedy',
 'Drama',
 'Comedy',
 'Romance',
 'Comedy',
 'Action',
 'Sci-Fi',
 'Documentary',
 'Comedy',
 'Romance',
 'Comedy',
 'Drama',
 'Romance',
 'Comedy',
 'Romance',
 'Drama',
 'Comedy',
 'Comedy',
 'Drama',
 'Drama',
 'Mystery',
 'Romance',
 'Drama',
 'Comedy',
 'Drama',
 'Thriller',
 'Adventure',
 "Children's",
 'Drama',
 'Drama',
 'Action',
 'Thriller',
 'Drama',
 'Western',
 'Action',
 'Comedy',
 'Drama',
 'Romance',
 'Action',
 'Adventure',
 'Crime',
 'Drama',
 'Thriller',
 'Action',
 'Adventure',
 'Crime',
 'Thriller',
 'Action',
 'Drama',
 'War',
 'Action',
 'Comedy',
 'War',
 'Comedy',
 'Comedy',
 'Romance',
 'Drama',
 'Romance',
 'Comedy',
 'Comedy',
 'Romance',
 'Comedy',
 'Drama',
 'Comedy',
 'War',
 'Action',
 'Thriller',
 'Drama',
 'Comedy',
 'Drama',
 'Drama',
 'Comedy',
 'Action',
 'Action',
 'Adventure',
 'Sci-Fi',
 'Drama',
 'Thriller',
 'Thriller',
 'Drama',
 'Adventure',
 "Children's",
 'Action',
 'Comedy',
 'Comedy',
 'Comedy',
 'Western',
 'Drama',
 'Comedy',
 'Thriller',
 'Drama',
 'Comedy',
 'Mystery',
 'Action',
 'Crime',
 'Drama',
 'Action',
 'Thriller',
 'Drama',
 'Comedy',
 'Drama',
 'Romance',
 'Comedy',
 'Romance',
 'Drama',
 'Romance',
 'Comedy',
 'Romance',
 'Comedy',
 'Drama',
 'Action',
 "Children's",
 'Drama',
 'Action',
 'Sci-Fi',
 'Comedy',
 'Drama',
 'Action',
 'Drama',
 'Drama',
 'Drama',
 'Romance',
 'Drama',
 'Action',
 'Drama',
 'Horror',
 'Sci-Fi',
 'Comedy',
 'Mystery',
 'Romance',
 'Comedy',
 'Drama',
 'Comedy',
 'Drama',
 'War',
 'Action',
 'Drama',
 'Mystery',
 'Comedy',
 'Sci-Fi',
 'Thriller',
 'Comedy',
 'Crime',
 'Thriller',
 'Action',
 'Drama',
 'Drama',
 'Drama',
 'Drama',
 'Drama',
 'Drama',
 'War',
 'Drama',
 'Drama',
 'Drama',
 "Children's",
 'Drama',
 'Comedy',
 'Crime',
 'Horror',
 'Action',
 'Drama',
 'Romance',
 'Drama',
 'Drama',
 'Comedy',
 'Drama',
 'Drama',
 'Comedy',
 'Romance',
 'Thriller',
 'Film-Noir',
 'Sci-Fi',
 'Comedy',
 'Comedy',
 'Romance',
 'Thriller',
 'Action',
 'Drama',
 'Action',
 'Adventure',
 "Children's",
 'Sci-Fi',
 'Action',
 'Adventure',
 'Thriller',
 'Action',
 'Documentary',
 'Comedy',
 'Romance',
 "Children's",
 'Comedy',
 'Musical',
 'Action',
 'Adventure',
 'Comedy',
 'Western',
 'Thriller',
 'Action',
 'Crime',
 'Romance',
 'Documentary',
 'Drama',
 'Action',
 'Adventure',
 'Animation',
 "Children's",
 'Fantasy',
 'Comedy',
 'Drama',
 'Thriller',
 'Comedy',
 'Drama',
 'Drama',
 'Comedy',
 'Horror',
 'Comedy',
 'Romance',
 'Drama',
 'Comedy',
 'Drama',
 "Children's",
 'Comedy',
 'Comedy',
 'Drama',
 'Drama',
 'Drama',
 'Drama',
 'Comedy',
 'Drama',
 "Children's",
 'Comedy',
 'Comedy',
 'Adventure',
 "Children's",
 'Drama',
 'Mystery',
 'Thriller',
 'Drama',
 'Documentary',
 'Comedy',
 'Comedy',
 'Drama',
 'Drama',
 'Comedy',
 "Children's",
 'Comedy',
 'Comedy',
 'Romance',
 'Thriller',
 'Animation',
 "Children's",
 'Comedy',
 'Musical',
 'Action',
 'Sci-Fi',
 'Thriller',
 'Adventure',
 ...]

In [5]:
# 用 pd.unique() 函式找出到底有哪些不重複的電影類型
genres=pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [6]:
# 準備來建立虛擬變數   
zero_matrix=np.zeros((len(movies),len(genres)))
dummy=pd.DataFrame(zero_matrix ,columns=genres)
dummy

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [7]:
#取出第0項genres的值
gen=movies.genres[0].split('|')
gen

['Animation', "Children's", 'Comedy']

In [31]:
# index 物件有 .get_indexer() 方法，給索引標籤會返回位置
dummy.columns.get_indexer(gen)

array([0, 1, 2], dtype=int64)

In [9]:
dummy

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [10]:
#原始資料和虛擬變數資料合併

# pd.concat([movies,dummy.add_prefix('gen')],axis=1)

new_col=movies.join(dummy.add_prefix('gen'))
new_col

,movie_id,title,genres,genAnimation,genChildren's,genComedy,genAdventure,genFantasy,genRomance,genDrama,...,genCrime,genThriller,genHorror,genSci-Fi,genDocumentary,genWar,genMusical,genMystery,genFilm-Noir,genWestern
0,1,Toy Story (1995),Animation|Children's|Comedy,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,3948,Meet the Parents (2000),Comedy,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,3949,Requiem for a Dream (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,3950,Tigerland (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,3951,Two Family House (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,3952,"Contender, The (2000)",Drama|Thriller,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [11]:
#想看玩具總動員的資料型態
new_col.loc[0]

movie_id                                    1
title                        Toy Story (1995)
genres            Animation|Children's|Comedy
genAnimation                              0.0
genChildren's                             0.0
genComedy                                 0.0
genAdventure                              0.0
genFantasy                                0.0
genRomance                                0.0
genDrama                                  0.0
genAction                                 0.0
genCrime                                  0.0
genThriller                               0.0
genHorror                                 0.0
genSci-Fi                                 0.0
genDocumentary                            0.0
genWar                                    0.0
genMusical                                0.0
genMystery                                0.0
genFilm-Noir                              0.0
genWestern                                0.0
Name: 0, dtype: object

------------------------------

#  <font color=red> Module_06_資料整理與前處理</font>

## 如何處理資料遺漏

### 先建立一個有遺漏值的資料框

In [3]:
import pandas as pd
import numpy as np
from datetime import datetime

df = pd.DataFrame(np.arange(0, 15).reshape(5, 3),
                 index = ['a', 'b', 'c', 'd', 'e'],
                 columns = ['c1', 'c2', 'c3'])
df

   c1  c2  c3
a   0   1   2
b   3   4   5
c   6   7   8
d   9  10  11
e  12  13  14

In [2]:
# pandas 使用了浮點數值 NaN (Not a Number) 來代表遺失資料，我們稱這個易於辨識的值為標記值
df['c4'] = np.nan

In [3]:
df.loc['f'] = np.arange(15, 19)

In [4]:
df

   c1  c2  c3    c4
a   0   1   2   NaN
b   3   4   5   NaN
c   6   7   8   NaN
d   9  10  11   NaN
e  12  13  14   NaN
f  15  16  17  18.0

In [5]:
df.loc['a']['c4']

nan

In [6]:
type(df.loc['a']['c4'])    #容易誤導

numpy.float64

---

In [7]:
df.loc['g'] = np.nan
df['c5'] = np.nan

In [8]:
df

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0   NaN NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [14]:
df['c4']['a'] = 20

In [15]:
df

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0  10.0 NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

### 判定 pandas 物件裡的 NaN 值

In [16]:
df

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0  10.0 NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [17]:
# 返回還是資料框
df.isnull()

      c1     c2     c3     c4    c5
a  False  False  False  False  True
b  False  False  False   True  True
c  False  False  False  False  True
d  False  False  False   True  True
e  False  False  False   True  True
f  False  False  False  False  True
g   True   True   True   True  True

In [18]:
# 注意在 python 中，NaN代表遺失值，它是 float 資料型態，重點是 np.nan != np.nan
# 但是 None = None
# 下面的方法會得到不是我們要的結果
df == np.nan

      c1     c2     c3     c4     c5
a  False  False  False  False  False
b  False  False  False  False  False
c  False  False  False  False  False
d  False  False  False  False  False
e  False  False  False  False  False
f  False  False  False  False  False
g  False  False  False  False  False

In [19]:
df

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0  10.0 NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [20]:
# 每個欄位有幾個遺失值   #預設值 axis=0
df.isnull().sum()

c1    1
c2    1
c3    1
c4    4
c5    7
dtype: int64

In [21]:
df.isnull().sum(axis = 1)

a    1
b    2
c    1
d    2
e    2
f    1
g    5
dtype: int64

In [22]:
# 資料框內總共有幾個遺失值
df.isnull().sum().sum()

14

---

In [23]:
df

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0  10.0 NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [24]:
# 資料框的 .count() 方法是計算非 NaN 的個數，預設 axis = 0
df.count()

c1    6
c2    6
c3    6
c4    3
c5    0
dtype: int64

In [25]:
# 也可以得到資料框內總共有幾個遺失值
(len(df) - df.count()).sum()

14

-----------------

In [26]:
# 反過來問，還是返回資料框
df.notnull()

      c1     c2     c3     c4     c5
a   True   True   True   True  False
b   True   True   True  False  False
c   True   True   True   True  False
d   True   True   True  False  False
e   True   True   True  False  False
f   True   True   True   True  False
g  False  False  False  False  False

In [27]:
df.notnull().sum().sum()

21

In [28]:
df.size   #全部幾個

35

### 排除遺漏的資料項

In [29]:
df

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0  10.0 NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [30]:
# 看看 c4 行的非 NaN 的值
# 布林選擇
df.c4[df.c4.notnull()]

a    20.0
c    10.0
f    18.0
Name: c4, dtype: float64

In [31]:
# 使用序列的 .dropna() 得到同樣的效果
# not in-place
# 預設 axis = 0 and how = 'any'，也就是只要有出 NaN 就把那一列刪了 
df.c4.dropna()

a    20.0
c    10.0
f    18.0
Name: c4, dtype: float64

In [32]:
df.c4

a    20.0
b     NaN
c    10.0
d     NaN
e     NaN
f    18.0
g     NaN
Name: c4, dtype: float64

In [33]:
df

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0  10.0 NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [34]:
# 資料框的 .dropna() 方法
# 預設 axis = 0 and how = 'any'，也就是只要有出 NaN 就把那一列刪了 # not in-place
df.dropna()

Empty DataFrame
Columns: [c1, c2, c3, c4, c5]
Index: []

In [35]:
# 要整列都是 NaN 才會刪掉
df.dropna(how = 'all')

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0  10.0 NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN

In [36]:
# 先把整列都是 NaN 的列刪了，再把欄只要有  NaN 的也都刪了!
df.dropna(how = 'all').dropna(axis = 1, how = 'any')

     c1    c2    c3
a   0.0   1.0   2.0
b   3.0   4.0   5.0
c   6.0   7.0   8.0
d   9.0  10.0  11.0
e  12.0  13.0  14.0
f  15.0  16.0  17.0

In [37]:
df

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0  10.0 NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [38]:
df.dropna(axis = 1, how = 'all')

     c1    c2    c3    c4
a   0.0   1.0   2.0  20.0
b   3.0   4.0   5.0   NaN
c   6.0   7.0   8.0  10.0
d   9.0  10.0  11.0   NaN
e  12.0  13.0  14.0   NaN
f  15.0  16.0  17.0  18.0
g   NaN   NaN   NaN   NaN

---

In [39]:
df2 = df.copy()
df2

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0  10.0 NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [40]:
df2.loc['g']['c1'] = 0
df2.loc['g']['c3'] = 0

In [41]:
df2

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0  10.0 NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   0.0   NaN   0.0   NaN NaN

In [42]:
df2.dropna(axis = 1, how = 'any', inplace = True)

In [43]:
df2

     c1    c3
a   0.0   2.0
b   3.0   5.0
c   6.0   8.0
d   9.0  11.0
e  12.0  14.0
f  15.0  17.0
g   0.0   0.0

---

In [44]:
df

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0  10.0 NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [45]:
# thresh 參數就是 threshold ，臨界點的意思
# 至少五個 不是遺失值 才不會被捨棄
df.dropna(thresh=5 ,axis = 1)

     c1    c2    c3
a   0.0   1.0   2.0
b   3.0   4.0   5.0
c   6.0   7.0   8.0
d   9.0  10.0  11.0
e  12.0  13.0  14.0
f  15.0  16.0  17.0
g   NaN   NaN   NaN

### 在數學運算中處理 NaN 值

In [46]:
a = np.array([1, 2, np.nan, 3])
b = pd.Series(a)
a

array([ 1.,  2., nan,  3.])

In [47]:
b

0    1.0
1    2.0
2    NaN
3    3.0
dtype: float64

In [48]:
a.mean() # Numpy 函式與方法遇到 NaN 通常會回傳 NaN

nan

In [49]:
b.mean() # pandas 函式與方法通常會忽略 NaN # 所以答案是 (1+2+3)/3 = 2

2.0

---

In [50]:
df

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0  10.0 NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [51]:
s = df.c4
s

a    20.0
b     NaN
c    10.0
d     NaN
e     NaN
f    18.0
g     NaN
Name: c4, dtype: float64

In [52]:
s.sum()

48.0

In [53]:
s.mean()

16.0

In [54]:
# 就算是累積總和的方法 .cumsum() 也是會忽略遺失值
s.cumsum()

a    20.0
b     NaN
c    30.0
d     NaN
e     NaN
f    48.0
g     NaN
Name: c4, dtype: float64

In [55]:
df.c4 + 1 # 但如果是傳統的數學運算子，NaN 會傳遞到最終的結果

a    21.0
b     NaN
c    11.0
d     NaN
e     NaN
f    19.0
g     NaN
Name: c4, dtype: float64

### 填入遺漏的資料

In [56]:
df

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0  10.0 NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [57]:
# 只要是遺失值的都填入 0
# not in-place
filled = df.fillna(0) 
filled

     c1    c2    c3    c4   c5
a   0.0   1.0   2.0  20.0  0.0
b   3.0   4.0   5.0   0.0  0.0
c   6.0   7.0   8.0  10.0  0.0
d   9.0  10.0  11.0   0.0  0.0
e  12.0  13.0  14.0   0.0  0.0
f  15.0  16.0  17.0  18.0  0.0
g   0.0   0.0   0.0   0.0  0.0

In [58]:
df.mean()

c1     7.5
c2     8.5
c3     9.5
c4    16.0
c5     NaN
dtype: float64

In [59]:
# 注意!! 填完遺失值的數學統計量跟未填入算出來會產生不同的結果
# 遺失值如果沒有被填入，在操作 pandas 的方法時通常會被忽略
filled.mean()   #/7

c1    6.428571
c2    7.285714
c3    8.142857
c4    6.857143
c5    0.000000
dtype: float64

---

In [60]:
df2 = df.copy()
df2

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0  10.0 NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [61]:
# 可以給個字典，給出哪個欄位的遺失值要填入哪個值
# not in-place
df2.fillna({'c2': 0, 'c4': 100})

     c1    c2    c3     c4  c5
a   0.0   1.0   2.0   20.0 NaN
b   3.0   4.0   5.0  100.0 NaN
c   6.0   7.0   8.0   10.0 NaN
d   9.0  10.0  11.0  100.0 NaN
e  12.0  13.0  14.0  100.0 NaN
f  15.0  16.0  17.0   18.0 NaN
g   NaN   0.0   NaN  100.0 NaN

In [62]:
df2

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0  10.0 NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [63]:
df2.fillna({'c2': 0, 'c4': 100}, inplace = True)
df2

     c1    c2    c3     c4  c5
a   0.0   1.0   2.0   20.0 NaN
b   3.0   4.0   5.0  100.0 NaN
c   6.0   7.0   8.0   10.0 NaN
d   9.0  10.0  11.0  100.0 NaN
e  12.0  13.0  14.0  100.0 NaN
f  15.0  16.0  17.0   18.0 NaN
g   NaN   0.0   NaN  100.0 NaN

### 以向前及向後方式填充遺漏值

In [64]:
df.c4

a    20.0
b     NaN
c    10.0
d     NaN
e     NaN
f    18.0
g     NaN
Name: c4, dtype: float64

In [65]:
# 在處理時間序列時常用的方法
df.c4.fillna(method = 'ffill')

a    20.0
b    20.0
c    10.0
d    10.0
e    10.0
f    18.0
g    18.0
Name: c4, dtype: float64

In [66]:
 # 也有 pd.ffill() 與 pd.bfill() 全域函式可以使用
df.c4.fillna(method = 'bfill')

a    20.0
b    10.0
c    10.0
d    18.0
e    18.0
f    18.0
g     NaN
Name: c4, dtype: float64

---

In [67]:
df

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0  10.0 NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [68]:
# 在資料框上也是類似的效果
df.fillna(method = 'ffill')

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0  20.0 NaN
c   6.0   7.0   8.0  10.0 NaN
d   9.0  10.0  11.0  10.0 NaN
e  12.0  13.0  14.0  10.0 NaN
f  15.0  16.0  17.0  18.0 NaN
g  15.0  16.0  17.0  18.0 NaN

In [69]:
# 參數 limit 可以限制最多填入幾次遺失值
df.fillna(method = 'ffill', axis = 1, limit = 1)

     c1    c2    c3    c4    c5
a   0.0   1.0   2.0  20.0  20.0
b   3.0   4.0   5.0   5.0   NaN
c   6.0   7.0   8.0  10.0  10.0
d   9.0  10.0  11.0  11.0   NaN
e  12.0  13.0  14.0  14.0   NaN
f  15.0  16.0  17.0  18.0  18.0
g   NaN   NaN   NaN   NaN   NaN

### 利用索引標籤填值

In [70]:
df

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0  10.0 NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [71]:
fill_valued = pd.Series([100, 101, 102], index = ['a', 'e', 'g'])
fill_valued

a    100
e    101
g    102
dtype: int64

In [72]:
df.c4

a    20.0
b     NaN
c    10.0
d     NaN
e     NaN
f    18.0
g     NaN
Name: c4, dtype: float64

In [73]:
# 只有 NaN 的項目才能被擴充取代，注意標籤 a 的值沒變
# 裡面的 fill_valued 也可以是字典
df.c4.fillna(fill_valued)

a     20.0
b      NaN
c     10.0
d      NaN
e    101.0
f     18.0
g    102.0
Name: c4, dtype: float64

---

In [74]:
df

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0  10.0 NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [75]:
df.mean()

c1     7.5
c2     8.5
c3     9.5
c4    16.0
c5     NaN
dtype: float64

In [76]:
# 非常常見又方便的作法，每個欄位的遺失值都用那個欄位的平均值取代
# 如果是資料框，序列對應都是在看欄位
df.fillna(df.mean())

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0  16.0 NaN
c   6.0   7.0   8.0  10.0 NaN
d   9.0  10.0  11.0  16.0 NaN
e  12.0  13.0  14.0  16.0 NaN
f  15.0  16.0  17.0  18.0 NaN
g   7.5   8.5   9.5  16.0 NaN

### 內插求出遺漏值

In [77]:
s = pd.Series([1, np.nan, np.nan, np.nan, 2])
s

0    1.0
1    NaN
2    NaN
3    NaN
4    2.0
dtype: float64

In [78]:
s.interpolate()

0    1.00
1    1.25
2    1.50
3    1.75
4    2.00
dtype: float64

In [79]:
# 預設是以位置做內插
# 如果你的資料代表漸增的值，例如溫度，這方法比補 0 好多了
# 0 到 4 走了 (4 - 0) = 4 個單位
# 值從 1 變化到 2
# 1 單位變化了 (2-1)/(4-0) = 0.25
s.interpolate()

0    1.00
1    1.25
2    1.50
3    1.75
4    2.00
dtype: float64

---

In [80]:
ts = pd.Series([1, np.nan, 2],
              index = [datetime(2014, 1, 1), datetime(2014, 2, 1), datetime(2014, 4, 1)])
ts

2014-01-01    1.0
2014-02-01    NaN
2014-04-01    2.0
dtype: float64

In [81]:
# 一單位變化了 (2 - 1)/(2 - 0) = 0.5
# 預設是看位置
# 但如果考慮到日期索引，有更好的方式
ts.interpolate()

2014-01-01    1.0
2014-02-01    1.5
2014-04-01    2.0
dtype: float64

In [82]:
# 方法改成看時間
# 所以一天變化了 (2 - 1)/(datetime(2014, 4, 1) - datetime(2014, 1, 1))   #日期天數
# 再看 1/1 到 2/1 過了幾天!
ts.interpolate(method = 'time')

2014-01-01    1.000000
2014-02-01    1.344444
2014-04-01    2.000000
dtype: float64

---

In [83]:
s = pd.Series([0, np.nan, 100], index = [0, 1, 10])
s

0       0.0
1       NaN
10    100.0
dtype: float64

In [84]:
# 預設是以位置做內插
# 一單位變化了 (100 - 0)/(2 - 0) = 50 個值
s.interpolate()

0       0.0
1      50.0
10    100.0
dtype: float64

In [85]:
# 按照索引值做內插 
# 所以一單位變化了 (100 - 0)/(10 - 0) = 10 個值
s.interpolate(method = 'values')

0       0.0
1      10.0
10    100.0
dtype: float64

## 處理重複資料

In [86]:
data = pd.DataFrame({'a': ['x']*3 + ['y']*4,
                     'b': [1, 1, 2, 3, 3, 4, 4]})
data

   a  b
0  x  1
1  x  1
2  x  2
3  y  3
4  y  3
5  y  4
6  y  4

In [87]:
data.duplicated() # 由上往下看是否有重複列

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [88]:
# 有 in-place 參數可供使用
# 預設 keep = 'first'
# 也可以用 data[~data.duplicated()]

data.drop_duplicates()

   a  b
0  x  1
2  x  2
3  y  3
5  y  4

In [89]:
data.drop_duplicates(keep = 'last')

   a  b
1  x  1
2  x  2
4  y  3
6  y  4

---

In [90]:
data['c'] = range(7)
data

   a  b  c
0  x  1  0
1  x  1  1
2  x  2  2
3  y  3  3
4  y  3  4
5  y  4  5
6  y  4  6

In [91]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [92]:
data.drop_duplicates(['a', 'b']) # 只看 a 與 b 行來決定

   a  b  c
0  x  1  0
2  x  2  2
3  y  3  3
5  y  4  5

## 資料轉換

### 將資料映射成不同的值

In [93]:
import pandas as pd
import numpy as np

x = pd.Series({'one': 1, 'two': 2, 'three':3})
x

one      1
two      2
three    3
dtype: int64

In [94]:
y = pd.Series({1:'a', 2:'b', 3:'c'})
y

1    a
2    b
3    c
dtype: object

#df.apply() 用在序列 
#series.apply()  用在值
#df.applymap()  用在值，沒有序列方法
#series.map()  用在值，沒有資料框方法

In [95]:
# 順便想想 python 是如何操作 map() 函式
# 在 mod02 我們有討論過 # series.map() 作用在值上，沒有資料框方法
# 裡面放函數，然後作用在每個值上 # 如果放序列也是類似的

x.map(y)

one      a
two      b
three    c
dtype: object

------------------

In [96]:
x = pd.Series({'one': 1, 'two': 2, 'three':3}) 
y = pd.Series({1:'a', 2:'b'})
x

one      1
two      2
three    3
dtype: int64

In [97]:
y

1    a
2    b
dtype: object

In [98]:
x.map(y) # 沒有對應關係會出現 NaN

one        a
two        b
three    NaN
dtype: object

---

In [4]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [5]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [6]:
# 利用 .str 屬性會拿到字串物件，再利用字串的 lower() 方法
# 會一一對每個值操作 .lower() 方法
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [7]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [8]:
# 另一種寫法得到同樣結果 
# 也可以用 .apply() 方法
# df.apply() 方法作用在序列，series.apply() 方法作用在值上

data['food'].map(lambda x: meat_to_animal[x.lower()])  # 得到同樣結果 # 也可以用 .apply() 方法

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### 值的取代

In [9]:
s = pd.Series([0, 1, 2, 3, 2, 4], index = np.arange(2, 8))
s

2    0
3    1
4    2
5    3
6    2
7    4
dtype: int64

In [10]:
s.replace(2, 5) # 值是 2 的換成 5 # not in-place

2    0
3    1
4    5
5    3
6    5
7    4
dtype: int64

In [11]:
s

2    0
3    1
4    2
5    3
6    2
7    4
dtype: int64

-------------

In [12]:
s

2    0
3    1
4    2
5    3
6    2
7    4
dtype: int64

In [13]:
s.replace([2, 3], np.nan)  # 值是 2 或 3 的都換成遺失值

2    0.0
3    1.0
4    NaN
5    NaN
6    NaN
7    4.0
dtype: float64

In [14]:
s.replace([3, 4, 0], [7, 8, 1]) # 值是 3 的換成 7，值是 4 的換成 8，值是 0 的換成 1

2    1
3    1
4    2
5    7
6    2
7    8
dtype: int64

In [15]:
# 也可用字典表達
# 值 0 換成 100，值 3 換成 300

s.replace({0: 100, 3: 300})

2    100
3      1
4      2
5    300
6      2
7      4
dtype: int64

---

In [16]:
ss = s.copy()
ss[3] = np.nan   #不明確就是看索引標籤
ss

2    0.0
3    NaN
4    2.0
5    3.0
6    2.0
7    4.0
dtype: float64

In [17]:
ss.replace(np.nan, 0, inplace = True)

In [18]:
ss

2    0.0
3    0.0
4    2.0
5    3.0
6    2.0
7    4.0
dtype: float64

---

In [19]:
df = pd.DataFrame({'a': [0, 1, 2, 3, 4], 
                   'b': [5, 6, 7, 1, 9]})
df

   a  b
0  0  5
1  1  6
2  2  7
3  3  1
4  4  9

In [20]:
# 資料框的 .replace() 方法，把值 1 的都換 10
df.replace(1, 10)

    a   b
0   0   5
1  10   6
2   2   7
3   3  10
4   4   9

In [21]:
# 資料框的 .replace() 方法，把欄位 a 值是 1 跟欄位 b 值是 9 的都換 10
df.replace({'a': 2, 'b': 9}, 10)

    a   b
0   0   5
1   1   6
2  10   7
3   3   1
4   4  10

---

In [22]:
s

2    0
3    1
4    2
5    3
6    2
7    4
dtype: int64

In [23]:
# 值是 0 或 4 的，用 ffill 方法填入
s.replace([0, 4], method = 'ffill')

2    0
3    1
4    2
5    3
6    2
7    2
dtype: int64

In [24]:
# 值是 0 或 4 的，用 bfill 方法填入
s.replace([0, 4], method = 'bfill')

2    1
3    1
4    2
5    3
6    2
7    4
dtype: int64

### 更名軸 index

In [25]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data2 = data.copy()
data2

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [26]:
data2.columns = ['col1', 'col2', 'col3', 'col4']
data2.index = ['a', 'b', 'c']
data2

   col1  col2  col3  col4
a     0     1     2     3
b     4     5     6     7
c     8     9    10    11

---

In [27]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [28]:
transform = lambda x: x[:4].upper()

In [29]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [30]:
data.index = data.index.map(transform)

In [31]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

---

In [32]:
data.rename(index = str.title, columns = str.upper) # index 與 columns 參數也可以接函式或方法

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [33]:
# 用 .rename() 方法可以只單獨改某幾個索引標籤
data.rename(index = {'OHIO': 'INDIANA'},
            columns = {'three': 'peekaboo'}) # 參數可以接字典

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [34]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [35]:
data.rename(index = {'OHIO': 'INDIANA'},
            columns = {'three': 'peekaboo'}, inplace = True)
data

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

### 離散化和分組

In [36]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [37]:
bins = [18, 25, 35, 60, 100]
cats =pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [38]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [39]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [40]:
cats.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [41]:
cats.describe()   #categories的describe 跟 Series的describe 不一樣

            counts     freqs
categories
(18, 25]         5  0.416667
(25, 35]         3  0.250000
(35, 60]         3  0.250000
(60, 100]        1  0.083333

---

In [42]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
df = pd.DataFrame(ages, columns = ['age'] )
df

    age
0    20
1    22
2    25
3    27
4    21
5    23
6    37
7    31
8    61
9    45
10   41
11   32

In [43]:
bins = [18, 25, 35, 60, 100]
labels = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(df['age'], bins = bins, labels = labels )

0          Youth
1          Youth
2          Youth
3     YoungAdult
4          Youth
5          Youth
6     MiddleAged
7     YoungAdult
8         Senior
9     MiddleAged
10    MiddleAged
11    YoungAdult
Name: age, dtype: category
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [ ]:
df['age_cat'] = pd.cut(df['age'], bins = bins, labels = labels )
df

In [ ]:
df['age_cat'].describe()

In [ ]:
df['age_cat'].value_counts()  # 更多內容請參考類別資料的章節

In [ ]:
df.sort_values(by = "age_cat")

### 偵測和濾除離群值

# 離群值 (outliers) 是一筆資料中異常過大或異常過小的數據值
# 離群值的發生通常是因為資料輸入時發生誤植、筆誤，也有可能是某個群體內的少數特例。在這樣的情況下，離群值的存在會破壞整個樣本的一致性，就像是壞了一鍋粥的那粒老鼠屎一樣，它會影響預測的準確性，導致分析後的結果難以解釋。

# 如何檢測離群值?

# 3 倍標準差法: 如果資料集符合常態分布，那就可以用 3 倍標準差法，因為常態分布的資料落在 3 倍標準差的機率是 99.7% 左右，如果跑到
# 3 倍標準差外的那些資料屬於小機率事件，這種資料可以歸為離群值。當然如果資料不符合常態分布，那你也可以自行設定遠離平均值外多少倍
# 的標準差當作你認定的離群值。

# Boxplots 法: 四分位距 (IQR) 就是上四分位與下四分位的差值。而我們通過 IQR 的 1.5 倍為標準，規定：超過上四分位 +1.5 倍 IQR 距離，或# 者下四分位 -1.5 倍 IQR 距離的點為離群值，後面章節會講解

面對這些離群值，我們該怎麼處理?

1.直接刪除: 確認過離群值對於資料集來說並無存在特殊意義，直接將該值刪除。
2.視為遺失值: 將異常值視為遺失值，後續利用處理缺失值的方法進行。
3.用平均值調整: 利用前後兩個資料點的平均值修正該異常值。或是用 3 個標準差的值取代
4.不處理: 忽視異常值，直接對資料集進行後續分析。

---------------

In [ ]:
np.random.seed(123456)
data = pd.DataFrame(np.random.randn(1000, 4)) # 母體平均值是 0，標準差是 1
data[:10]

In [ ]:
data.describe()

In [ ]:
data_cp = data.copy()
data_cp

In [ ]:
# 找出第二欄位減去平均值的絕對值大於 3 個標準差的就是離群值
mask = np.abs(data_cp[2] - data_cp[2].mean()) > 3*data_cp[2].std() 
data_cp[2][mask]

In [ ]:
# 一種作法去除離群值
data_cp[~mask]

---

In [ ]:
data_cp

In [ ]:
# 找出那些列包含大於 3 個標準差的值
# 一種做法是把這些有包含離群值的列都刪除
for i in data_cp.columns:
    mask = np.abs(data_cp[i] - data_cp[i].mean()) > 3*data_cp[i].std()
    data_cp = data_cp[~mask]

In [ ]:
data_cp

In [ ]:
# 我們把有包含超過 3 個標準差的值的列都刪掉了
# 濾除離群值，通常利於之後的分析
data_cp.describe()

In [ ]:
# 跟沒有刪除離群值的統計量比較一下
# 刪除離群值的平均值跟標準差估的比較準一點
data.describe()

### 排列與隨機取樣

In [ ]:
df = pd.DataFrame(np.arange(20).reshape(5, 4), index = list('abced'))
df

In [ ]:
# 把 0, 1, 2, 3, 4 隨機排列，也就是洗牌的意思
samper = np.random.permutation(5)
samper

In [ ]:
df.iloc[samper]

In [ ]:
# 跟上面一樣結果
# 回憶一下之前學過的 series.take()   # 看是哪個資料型態的 .take() 方法，來得知返回的資料型態  #還原
# Return the elements in the given *positional* indices along an axis.
df.take(samper)

---

In [ ]:
# 隨機選出三列，預設 replace = False，也就是取後不放回
df.sample(n = 3)

In [ ]:
# 預設 replace = False，也就是取後不放回
# 就跟剛剛用 permutation 的效果是一樣
df.sample(n = len(df))

In [ ]:
# 取後放回，取出10筆
# 可參考我們 mod03，之前有稍微提過 .sample() 方法，複習一下
df.sample(n = 10, replace = True)

### 指標(indicator)與虛擬變數(dummy)

In [ ]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
df

In [ ]:
pd.get_dummies(df)  #dummy參考mod04   #把key的值 用 0 / 1 來補上，公平

In [ ]:
pd.get_dummies(df['key'])  #可以指定要dummy的列

In [ ]:
dummies = pd.get_dummies(df['key'], prefix = 'key') # 在欄位加上前綴
dummies

In [ ]:
# 注意 df[['data1']] 的寫法，出來會是一個資料框
# 因為只有資料框才有 .join() 方法，不然用 pd.concat() 函式也可以
# 資料框的 .join() 方法之後有章節會教到

df_with_dummy = df[['data1']].join(dummies) 
df_with_dummy

In [ ]:
pd.concat([df[['data1']], dummies], axis = 1)

---

In [ ]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('./mod06/movies.dat', sep='::',
                       header=None, names=mnames, encoding = "ISO-8859-1", engine = 'python') # 注意編碼跟引擎
movies

In [ ]:
# 也可以用 movies.genres.str.split("|")，再搭配迴圈
all_genres = []
for i in movies.genres:
    all_genres.extend(i.split('|'))
all_genres

In [ ]:
# 用 pd.unique() 函式找出到底有哪些不重複的電影類型
genres = pd.unique(all_genres)
genres

In [ ]:
# 準備來建立虛擬變數
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns = genres)
dummies

In [ ]:
#取出第0項的值
gen = movies.genres[0].split('|')
gen

In [ ]:
# index 物件有 .get_indexer() 方法，給索引標籤會返回位置
dummies.columns.get_indexer(gen)

In [ ]:
#(法二)
# 其實也可以不用轉成位置，直接用索引標籤操作
for i, gen in enumerate(movies.genres):
    indices =  dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i][indices] = 1

In [ ]:
dummies

In [ ]:
#原始資料和虛擬變數資料合併
# 也可以用 pd.concat([movies, dummies.add_prefix('Genre')], axis = 1)
movies_windic = movies.join(dummies.add_prefix('Genre'))# 資料框有 add.prefix() 方法，幫你把欄位名加前綴字
movies_windic

In [ ]:
movies_windic.iloc[0]

---

In [ ]:
np.random.seed(12345)
values = np.random.rand(10)
values

In [ ]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [ ]:
# 這是類別物件
cat = pd.cut(values, bins = bins)
cat

In [ ]:
cat.value_counts()

In [ ]:
cat.describe()

In [ ]:
# pd.get_dummies 函式放入類別物件的效果
pd.get_dummies(cat)

### 套用函數來轉換資料

In [ ]:
# 在 mod02 已經有學過，可以複習一下
s = pd.Series(np.arange(0, 5))
s

In [ ]:
# df.apply() 方法作用在序列，series.apply() 方法作用在值上
# 這裡用 map() 方法效果會一樣
s.apply(lambda x: x*2)

---

In [ ]:
df = pd.DataFrame(np.arange(12).reshape(4, 3),
                 columns = ['a', 'b', 'c'])
df

In [ ]:
df.apply(lambda x: x.sum()) # 預設 axis = 0

In [ ]:
df.apply(lambda x: x.sum(), axis = 1)

In [ ]:
# 注意這裡的軸容易被誤導
# axis = 0 or ‘index’: apply function to each column.
# axis = 1 or ‘columns’: apply function to each row.

df['interim'] = df.apply(lambda x: x['a']*x['b'], axis = 1)
df

In [ ]:
df['result'] = df.apply(lambda x: x['c'] + x['interim'], axis = 1)
df

---

In [ ]:
df = pd.DataFrame(np.arange(0, 15).reshape(3, 5))
df.loc[1, 2] = np.nan
df

In [ ]:
df.dropna().apply(lambda x: x.sum(), axis = 1)

---

In [ ]:
df

In [ ]:
df.applymap(lambda x: '%.2f' % x)

In [ ]:
# 跟上面一樣是字串格式化，也可以用 f-string
df.applymap(lambda x: '{:.2f}'.format(x))

## 字串操作

### 字串物件的方法

In [1]:
import pandas as pd
import numpy as np
import re

val = 'a, b, guido'

In [15]:
val.split(',')   #先區隔逗號  #split()切出來回傳list

['a', ' b', ' guido']

In [32]:
# pieces = [i.strip(' ') for i in val.split(',')]   #再把空格去掉
# pieces


pieces = [i.replace(' ','') for i in val.split(',')]
pieces

['a', 'b', 'guido']

In [20]:
# 可能會想把他們用符號 :: 連起來
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [21]:
'::'.join(pieces) # 實務上比較常用的做法

'a::b::guido'

-------------------

In [23]:
# 成員運算子
'guido' in val

True

In [25]:
# 字串的 .index 方法    #逗號在第幾個索引
val.index(',')

1

In [26]:
val.find(':') # -1 表示找不掉

-1

In [27]:
val.index(':') # .find() 方法跟 .index() 方法的差別

#find() 不會報錯
#index() 會報錯

ValueError: substring not found

In [28]:
val.count(',')

2

In [29]:
val.replace(',', '::')

'a:: b:: guido'

In [30]:
val.replace(',', '')

'a b guido'

### 正規表達式

In [33]:
text = "foo    bar\t baz  \tqux"
print(text)

foo    bar	 baz  	qux

In [34]:
# 滿足正規表達式的切割符號，會返回列表
re.split(r'\s+', text)

['foo', 'bar', 'baz', 'qux']

-----------

In [39]:
regex = re.compile(r'\s+') 


# 手動呼叫 re.compile() 來編譯一個 regex，這樣可以有重複可用的 regex 物件   
#re.compile()裡面只需要寫正規表達式的規則

In [40]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [41]:
regex.findall(text)

['    ', '\t ', '  \t']

---

In [46]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [47]:
# 有加 flags = re.IGNORECASE，我們就可以不用再加入小寫
# 另一種寫法: re.findall(pattern, text, flags=re.IGNORECASE)

pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex = re.compile(pattern, flags = re.IGNORECASE)
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [48]:
m = regex.search(text)
m

In [54]:
m = regex.match(text)
m

In [57]:
# redacted 的意思是為了模糊或刪除敏感信息而做出特殊編輯的
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [64]:
text   #用print() 換行符號才會發揮效用

'Dave dave@google.com\nSteve steve@gmail.com\nRob rob@gmail.com\nRyan ryan@yahoo.com\n'

In [65]:
# 不要忘記 flags= re.IGNORECASE，不然就一開始就把大小寫都加進 pattern 中
print(re.sub(pattern, 'REDACTED', text, flags= re.IGNORECASE))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

---

In [69]:
# 用括號 () 來分組
pattern = r'(([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4}))'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [70]:
m = regex.match('wesm@bright.net')
m.groups()

('wesm@bright.net', 'wesm', 'bright', 'net')

In [71]:
# group() 與 group(0) 傳回完整的搜尋字串
m.group(0)

'wesm@bright.net'

In [72]:
m.group(1)

'wesm@bright.net'

In [73]:
m.group(2)

'wesm'

In [76]:
m.group(3)

'bright'

In [78]:
text

'Dave dave@google.com\nSteve steve@gmail.com\nRob rob@gmail.com\nRyan ryan@yahoo.com\n'

In [77]:
regex.findall(text)

[('dave@google.com', 'dave', 'google', 'com'),
 ('steve@gmail.com', 'steve', 'gmail', 'com'),
 ('rob@gmail.com', 'rob', 'gmail', 'com'),
 ('ryan@yahoo.com', 'ryan', 'yahoo', 'com')]

In [79]:
print(regex.sub(r'Username: \2, Domain: \3, Suffix: \4', text)) # \2、\3 這樣特別的符號是來存取分段的結果

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### pandas 中向量字串函式

In [ ]:
import pandas as pd
import numpy as np
import re

data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

In [ ]:
data.isnull()

In [ ]:
# 遇到遺失值，直接用 .map() 或 .apply() 方法等都會產生例外喔!
# 所以要加個條件式過濾
# 不能寫 x == np.nan ，過濾遺失值會失敗
def func(x):
    if x is np.nan:
        return x
    else:
        pattern = r'gmail'
        m = re.search(pattern, x)
        if m:
            return True
        else:
            return False

data.map(func)

# 利用 Series.map() 方法可以將字串方法跟正規表達式套用在每個值上，不過碰到遺失值時會變得很麻煩
# Series 有幫我們建一些適用的陣列字串方法，這些方法可以跳過遺失值
# 我們可以透過 Series 的 str 屬性來進行這些字串的方法
# 例如用 str.contains() 來檢查郵件帳號中是否存在 "gmail" 這幾個字

In [ ]:
data.str.contains('gmail')

In [ ]:
pattern = r'(([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4}))'
data.str.findall(pattern, flags = re.IGNORECASE)

In [ ]:
# 利用可以分組的正規表達式，從字串 Series 中取出一個或多個字串，輸出結果是一個資料框，每個分組會有一欄
# 一定要分組，也就是給括號
matches = data.str.extract(pattern, flags = re.IGNORECASE)
matches

In [ ]:
matches[0]

In [ ]:
matches.iloc[:, 1]

---

In [ ]:
# 拿到字串物件後會對裡面每個字串做切片
data.str[:5]

---

In [ ]:
s = pd.Series(['**Crystal;L123  ', ' Matt;L456 ', 'Alice;L789 '])
s

In [ ]:
s = s.str.strip('*').str.strip(' ')
s

In [ ]:
s = s.str.split(';')
s

In [ ]:
df = pd.DataFrame(np.zeros((len(s), 2)))
df

In [ ]:
df.iloc[0] = s[0]

In [ ]:
for i in range(len(s)):
    df.iloc[i] = s[i]
df

----------------------------------

In [ ]:
s = pd.Series(['**Crystal;L123  ', ' Matt;L456 ', 'Alice;L789 '])
s

In [ ]:
pattern = r"([A-Za-z]+);([A-Z0-9]+)"
s.str.extract(pattern)

## 綜合應用

In [ ]:
import pandas as pd
import numpy as np

string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

In [ ]:
string_data.isnull()

In [ ]:
string_data[0] = None

In [ ]:
string_data

In [ ]:
string_data.isnull() # None 會被幫成 NaN